<?php

return [
    'required' => 'حقل :attribute مطلوب.',
    'email' => 'يجب أن يكون :attribute عنوان بريد إلكتروني صحيح.',
    'min' => [
        'string' => 'يجب أن يكون :attribute على الأقل :min أحرف.',
    ],
    'confirmed' => 'تأكيد :attribute غير مطابق.',
    'password' => [
        'min' => 'يجب أن تكون كلمة المرور على الأقل :min أحرف.',
        'regex' => 'يجب أن تحتوي كلمة المرور على الأقل على حرف كبير، حرف صغير، رقم، ورمز خاص.',
        'strong' => 'كلمة المرور ضعيفة جدًا.',
    ],
    'attributes' => [
        'email' => 'البريد الإلكتروني',
        'password' => 'كلمة المرور',
    ],
];
